Revit 2024 API
ColorSelectionDialog.OriginalColor Property
 The original color.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public Color OriginalColor { get; set; }
Visual Basic
Public Property OriginalColor As Color
	Get
	Set
Visual C++
public:
property Color^ OriginalColor {
	Color^ get ();
	void set (Color^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace